using System;

namespace makarovproject
{
    class WarshipCoding
    {
        public static void jogo()
        {
            /*
            if () { }
            else if () { }
            else { }
            */

            string tecla;
            do
            {
                Console.Clear();
                Console.WriteLine("Jogar");
                Console.WriteLine("Configuração");
                Console.WriteLine("Creditos");
                Console.WriteLine("Sair");
                Console.WriteLine("\r\nTECLAS:\r\nUse a tecla 1 para jogar \r\nTecla 2 para abrir as configurações\r\nTecla 3 Para abrir os créditos\r\nTecla 4 para fechar o jogo \r\nTecla X para sair dos menus!");
                tecla = Console.ReadLine();
                switch (tecla)
                {
                    case "1":
                        Console.WriteLine("Opção jogar escolhida");
                        //jogando();
                        break;

                    case "2":
                        Console.WriteLine("Essa opção faz com que você possa escolher as cores do terminal!.");
                        EscolherCor();
                        break;

                    case "3":
                        Console.WriteLine("Estes são os créditos!");
                        creditoJogador();
                        break;

                    case "4":
                        Console.WriteLine("Você escolheu sair. Obrigado por jogar e até a próxima!! xD");
                        break;

                    case "w":
                        Console.WriteLine("Cima");
                        break;

                    case "a":
                        Console.WriteLine("Esquerda");
                        break;

                    case "s":
                        Console.WriteLine("Baixo");
                        break;

                    case "d":
                        Console.WriteLine("Direita");
                        break;
                }
            } while (tecla != "4");
            // Console.WriteLine("............................................................................  \r\n.............................................................. |//>..........\r\n.............|//>...........................................................\r\n............................................................................\r\n.................................................+=>........................\r\n...........................|>......................................[ ]>.....\r\n............................................................................\r\n.......|>...................................................................\r\n............................................................................\r\n.................................................|>.........................\r\n..................................<\\\\|......................................\r\n......|/>...................................................................\r\n............................................................................\r\n.......................|>......................................<=+..........\r\n.........|//>...............................................................\r\n...........................................<|...............................\r\n.............................................................=>.............\r\n....................+ |> + .................................................");
        }
        int time = 1000;
        public static void EscolherCor()
        {
            string tecla;
            do
            {
                Console.Clear();
                Console.WriteLine("Aqui você tem a informação de teclas que mudam a cor e dá a possibilidade de escolher o que você vai querer no terminal.\r\nAs teclas para as cores são: \r\n5\r\n6\r\n7\r\n");
                tecla = Console.ReadLine();
                switch (tecla)
                {
                    case "5":
                        Console.WriteLine("Deseja Aplicar a cor Vermelha no terminal?\r\nY para confirmar\r\nN para Cancelar ");
                        string confi = Console.ReadLine();
                        if (confi == "y")
                        {
                            Console.ForegroundColor = ConsoleColor.Red;
                        }
                        break;

                    case "6":
                        Console.WriteLine("Deseja Aplicar a cor Amarela no terminal?\r\nY para confirmar\r\nN para Cancelar ");
                        string Conf = Console.ReadLine();
                        if (Conf == "y")
                        {
                            Console.ForegroundColor = ConsoleColor.Yellow;
                        }
                        break;

                    case "7":
                        Console.WriteLine("Deseja Aplicar a cor Verde no terminal?\r\nY para confirmar\r\nN para Cancelar ");
                        string Confirm = Console.ReadLine();
                        if (Confirm == "y")
                        {
                            Console.ForegroundColor = ConsoleColor.Green;
                        }
                        break;
                }


            } while (tecla != "x");
        }
        public static void creditoJogador()
        {
            string tecla;
            do
            {
                Console.Clear();
                Console.WriteLine("O jogo foi inspirado em navios e ações marítimas. Os navios foram expirados em símbolos que mostram o que cada é.\r\nBoa sorte se jogar novamente e busque o máximo de pontuação que conseguir!\r\nObrigado por jogar e até a próxima!");
                tecla = Console.ReadLine();
            } while (tecla != "x");
        }

    }
} 


/*
        public static void jogando()
        {
            string tecla;
            do
            {
                Console.Clear();
                Console.WriteLine("............................................................................  \r\n.............................................................. |//>..........\r\n.............|//>...........................................................\r\n............................................................................\r\n.................................................+=>........................\r\n...........................|>......................................[ ]>.....\r\n............................................................................\r\n.......|>...................................................................\r\n............................................................................\r\n.................................................|>.........................\r\n..................................<\\\\|......................................\r\n......|/>...................................................................\r\n............................................................................\r\n.......................|>......................................<=+..........\r\n.........|//>...............................................................\r\n...........................................<|...............................\r\n.............................................................=>.............\r\n....................+ |> + .................................................");
                tecla = Console.ReadLine();      
            } while (tecla != "x");

        }
    
    }
}
    // Console.WriteLine("............................................................................  \r\n.............................................................. |//>..........\r\n.............|//>...........................................................\r\n............................................................................\r\n.................................................+=>........................\r\n...........................|>......................................[ ]>.....\r\n............................................................................\r\n.......|>...................................................................\r\n............................................................................\r\n.................................................|>.........................\r\n..................................<\\\\|......................................\r\n......|/>...................................................................\r\n............................................................................\r\n.......................|>......................................<=+..........\r\n.........|//>...............................................................\r\n...........................................<|...............................\r\n.............................................................=>.............\r\n....................+ |> + .................................................");



//navio encontra outros navios e ele navega pelo mapinha a procura de outros navios e eliminá.los.
// existe Destroyers, Cruzadores, Battleships e Porta aviões 
// string destroyer = "Você recebe 10 pontos";
// string Cruzador = "Você recebe 20 pontos";
// string Battleship = "Você recebe 30 pontos";
// string portaAvioes = "Você recebe 50 pontos";

// Os navios vão aparecer ao decorrer do jogo e você terá  que destruir o máximo de návio que conseguir.
// Se caso você morrer = [ string morreu = "você perdeu o jogo" ]
// o jogo reinicia.
// DESTROYER = [ "  |> " ]
// CRUZADOR  = [ "  |/>  " ]
// BATTLESHIP = [ "  |//> " ]
// PORTA.AVIAO = [ " +=> "  ]

//Esses são os projéteis do návio:
// DISPARO DOS NAVIOS (TODOS) : [ " * " ]
// TORPEDO DOS CRUZADORES, DESTROIERS E AVIÕES  = [ " + " ]
// IDENTIFICAÇÃO DO AVIAO DO PORTA AVIAO = [ " /-*-\ " ]

/* MAPA DO JOGO  

OS  " . " REPRESENTAM O MAR DO JOGO.

............................................................................  
..............................................................|//>..........
.............|//>...........................................................
............................................................................
.................................................+=>........................
...........................|>......................................|>.......
............................................................................
.......|>...................................................................
............................................................................
.................................................|>.........................
..................................<\\|......................................
......|/>...................................................................
............................................................................
.......................|>......................................<=+..........
.........|//>...............................................................
...........................................<|...............................
.............................................................=>.............
.................... [ |> ] ................................................
        |
         --> "aqui está o jogador e ele começa com um Destroyer
                          tendo a possibilidade de upar seu navio ao decorrer
                          do jogo" 
*/
